# Intro

In [ ]:
!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.6/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.6/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.6/dist-packages (from db->db-sqlite3) (1.2.1)

In [1]:
import pandas as pd
import sqlite3
from datetime import date

In [2]:
#connecting with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text, Date datetime, Mobile text,Mail text)")
except:
  print("Already table existed !!")

In [ ]:
db = sqlite3.connect("testing.db")

In [ ]:
Date = date.today().strftime("%d-%m-%Y")
Name = "TestDemo"
Mobile = "9000011101"
Mail = "teachineMachine1@you.com"

In [ ]:
cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
db.execute(cmd)
db.commit()

# Querying

### Type - 1 Querying

In [ ]:
db = sqlite3.connect("testing.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('TestDemo', '18-08-2020', '9000011101', 'teachineMachine1@you.com')
('TestDemo', '18-08-2020', '9000011101', 'teachineMachine1@you.com')

### Type - 2 Querying

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com

# Batch-wise data storage

In [ ]:

def pushtoDB(Name,Mobile,Mail):
#inserting values inside the created table
    db = sqlite3.connect("testing.db")    
    from datetime import date
    Date = date.today().strftime("%d-%m-%Y")
    cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
    db.execute(cmd)
    db.commit()

In [ ]:
data = pd.read_csv("dummy.csv")
data.head()
data.shape

(1128, 3)

In [ ]:
pushtoDB("Testttt","121","2112")

In [ ]:
db = sqlite3.connect("testing.db")
qry = "SELECT * FROM results"
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
2   Testttt  18-08-2020         121                      2112

In [ ]:
for i in range(0,len(data)):
  pushtoDB(data.iloc[i][0],data.iloc[i][1],data.iloc[i][2])

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results WHERE Name="TestDemo"

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com
1  TestDemo  18-08-2020  9000011101  teachineMachine1@you.com